export const defines: {
    [key: string]: string
} = {
    'vk.message.about': 'Бот был создан [id290331922|Алексеем Костюком] из группы 63ТП. Для сообщения о багах или запроса функционала писать ему.\n\n' +
        'Небольшая статья, как настроить бота: https://vk.com/@mgke_slave-ispolzovanie-bota\n\n' +
        'Статья для учителей: https://vk.com/@mgke_slave-ispolzovanie-bota?anchor=dlya-uchiteley\n\n' +
        'Отключить/включить кнопку "О боте" можно в настройках.',

    'viber.message.about': 'Бот был создан Алексеем Костюком из группы 63ТП. Для сообщения о багах или запроса функционала писать ему в вк: https://vk.com/keller18306.\n\n' +
        'Небольшая статья, как настроить бота: https://vk.com/@mgke_slave-ispolzovanie-bota\n\n' +
        'Статья для учителей: https://vk.com/@mgke_slave-ispolzovanie-bota?anchor=dlya-uchiteley\n\n' +
        'Отключить/включить кнопку "О боте" можно в настройках.',

    'tg.message.about': 'Бот был создан Алексеем Костюком из группы 63ТП. Для сообщения о багах или запроса функционала писать ему в вк: https://vk.com/keller18306.\n\n' +
        'Небольшая статья, как настроить бота: https://vk.com/@mgke_slave-ispolzovanie-bota\n\n' +
        'Статья для учителей: https://vk.com/@mgke_slave-ispolzovanie-bota?anchor=dlya-uchiteley\n\n' +
        'Отключить/включить кнопку "О боте" можно в настройках.',

    'need.accept': 'У вас нет доступа, чтобы использовать бота.\n\n' +
        'Для получения доступа писать ему: [id290331922|Костюк Алексей]\n\n' +
        'Ключ, который нужно предоставить:\n%s',

    'success.accept': 'Доступ был успешно получен.\n\n' +
        'Небольшая статья, как настроить бота: https://vk.com/@mgke_slave-ispolzovanie-bota\n\n' +
        'Статья для учителей: https://vk.com/@mgke_slave-ispolzovanie-bota?anchor=dlya-uchiteley',

    'not.accepted': 'Доступ ещё не был выдан.\n\n' +
        'Для получения доступа писать ему: [id290331922|Костюк Алексей]\n\n' +
        'Ключ, который нужно предоставить:\n%s',

    'viber.first.message': 'Добро пожаловать!\nЭто бот для получения расписания уроков с сайта МГКЦТ. Для того, чтобы продолжить, нажмите на кнопку "Начать" ниже.',

    'eula': [
        '⚠️ Обратите внимание ⚠️',
        'Бот НЕ ЯВЛЯЕТСЯ официальным бота колледжа. Используя бота, вы принимаете, что информация, предоставленная ботом, может не соответствовать представленной на сайте или вовсе быть ошибочной. Разработчик за любые ошибки ответственности не несёт. (при ошибках можете сообщать разработчику и они будут своевременно исправлены)',
        'Также разработчик имеет полное право ограничить или же закрыть доступ к боту в любой момент без предупреждения. Доступ к боту предоставляется на безвозмездной основе со стороны разработчика.',
        'Продолжая использование бота вы подтверждаете, что согласны с данными условиями.'
    ].join('\n\n')
}